import React, { useEffect } from 'react';
import styled from 'styled-components';
import { UserState } from '../../../context/UserContext';

function TermsOfUse() {
	const {
		showLogin,
		showSignup
	} = UserState();
	
	useEffect(() => {
		if (showLogin || showSignup) {
			document.body.style.overflow = 'hidden'
		} else {
			document.body.style.overflow = 'unset';
		}
	}, [showLogin, showSignup])
	
  	return (
		<Wrapper>
			<h1 className='title section-title'>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h1>

			<div className='section-content'>
				<p className='section-mini-header'>Общие положения:</p>
				<ul>
					<li className='section-text'>Соглашение об обработке персональных данных (далее – «Соглашение») направлено на защиту прав и свобод физических лиц, персональные данные которых обрабатывает ИП Нурмухамбетов «Як» (далее – «Пользователь информации»).</li>
					<li className='section-text'>Соглашение разработано в соответствии с действующим законодательством Республики Казахстан и иными законодательными актами Республики Казахстан.</li>
					<li className='section-text'>Соглашение является общедоступным документом.</li>
				</ul>

				<p className='section-mini-header'>Сведения о Пользователе информации</p>
				<ul>
					<li className='section-text'>Пользователь информации – ИП Нурмухамбетов «Як» ИИН/БИН 840109350122 . Юридический адрес Пользователя информации: РК, г. Нур-султан, пр. Тауельсыздык 12/2, помещение №65</li>
				</ul>

				<p className='section-mini-header'>Сведения об обработке персональных данных</p>
				<ul>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные на законной и справедливой основе для достижения поставленных целей, в том числе для оказания услуг и передачи информации Владельцам персональных данных (далее – «Клиент»).</li>
					<li className='section-text'>Пользователь информации получает персональные данные непосредственно у Клиентов.</li>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные автоматизированными и неавтоматизированными способами, с использованием средств вычислительной техники и без использования таких средств.</li>
					<li className='section-text'>Действия по обработке персональных данных включают получение, сбор, обработку, накопление, хранение и использование.</li>
				</ul>
			
				<p className='section-mini-header'>Обработка персональных данных Клиентов</p>
				<ul>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные Клиента в рамках правоотношений с ним в соответствии с законодательством Республики Казахстан.</li>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные Клиентов с соблюдением норм законодательства Республики Казахстан с целью:</li>
					<li className='section-text'>приема обращений и заявок от Клиентов;</li>
					<li className='section-text'>информирования о новых товарах, специальных акциях и предложениях;</li>
					<li className='section-text'>направления электронного кассового чека в электронной форме;</li>
					<li className='section-text'>информационной рассылки.</li>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные Клиентов с их согласия, предоставляемого Клиентами и/или их законными представителями путем совершения конкретных действий на настоящем сайте «www.yak____.kz» (далее – «Сайт»), включая, но не ограничиваясь, оформлением заказа, регистрацией в личном кабинете, подпиской на рассылку, а также проставлением отметки о согласии, в соответствии с Соглашением.</li>
					<li className='section-text'>Пользователь информации обрабатывает персональные данные Клиентов не дольше, чем того требуют цели обработки персональных данных, если иное не предусмотрено законодательством Республики Казахстан.</li>
					<li className='section-text'>Пользователь информации может обрабатывать следующие персональные данные Клиентов:</li>
					<li className='section-text'>фамилия, имя, отчество;</li>
					<li className='section-text'>номер контактного телефона;</li>
					<li className='section-text'>адрес электронной почты.</li>
				</ul>
				
				<p className='section-mini-header'>Сведения об обеспечении безопасности персональных данных Клиентов</p>
				<ul>
					<li className='section-text'>Пользователь при обработке персональных данных принимает необходимые правовые, организационные и технические меры или обеспечивает их принятие для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных.</li>
					<li className='section-text'>Меры по обеспечению безопасности персональных данных при их обработке, применяемые Пользователем информации, планируются и реализуются в целях обеспечения соответствия требованиям Закона, а также иных законодательных актов Республики Казахстан.</li>
				</ul>
				
				<p className='section-mini-header'>Права Клиентов</p>
				<ul>
					<li className='section-text'>Клиент имеет право:</li>
					<li className='section-text'>на запрос о предоставлении используемых персональных данных;</li>
					<li className='section-text'>на уточнение (изменение) его персональных данных в случае, если они являются неполными, устаревшими, неточными;</li>
					<li className='section-text'>на отзыв данного им согласия на обработку персональных данных;</li>
					<li className='section-text'>на защиту своих прав и законных интересов, в том числе на возмещение убытков и компенсацию морального вреда в судебном порядке;</li>
					<li className='section-text'>на обжалование действий или бездействия Пользователя информации в уполномоченный орган по защите прав потребителей или в судебном порядке.</li>
					<li className='section-text'>Для реализации своих прав и законных интересов Клиент имеет право обратиться к Пользователю информации в порядке, предусмотренном законодательством Республики Казахстан.</li>
				</ul>
				
				<p className='section-mini-header'>Заключительные положения</p>
				<ul>
					<li className='section-text'>Соглашение и отношения между Пользователем информации и Клиентом регулируются и толкуются в соответствии с законодательством Республики Казахстан. Вопросы, не урегулированные Соглашением, подлежат разрешению в соответствии с законодательством Республики Казахстан.</li>
					<li className='section-text'>Соглашение представляет собой публичную оферту, в соответствии пунктом 5 статьи 395 Гражданского кодекса Республики Казахстан. Факт проставления отметки о согласии с содержанием Соглашения Клиентом на Сайте является полным и безоговорочным акцептом настоящего Соглашения (в соответствии с п.3 статьи 396 Гражданского кодекса Республики Казахстан). Незнание положений Соглашения не освобождает Клиента от ответственности за несоблюдение его условий.</li>
					<li className='section-text'>Пользователь информации оставляет за собой право по своему личному усмотрению изменять и (или) дополнять Соглашение в любое время без предварительного и (или) последующего уведомления Клиента. Действующая редакция Соглашения доступна в интерфейсе Сайта.</li>
					<li className='section-text'>Настоящее Соглашение в отношении каждого из Клиентов вступает в силу с момента совершения Клиентом действий, указанных в пункте 7.2 Соглашения, и действует до момента удаления аккаунта Клиентом.</li>
				</ul>
			</div>
		</Wrapper>
	);
}

const Wrapper = styled.nav`
	padding: 1.875rem 13.125vw 10rem;

	.section-title {
		font-size: 80px;
		font-weight: 500;
	}

	.section-content {
		width: 74.576%;
		margin-top: 2.5rem;
	}

	.section-mini-header {
		font-size: 18px;
		font-weight: 500;
	}

	.section-text {
		font-size: 18px;
		font-weight: 300;
	}

	@media (max-width: 1100px) {
		padding: 1.875rem 9vw 9.375rem;
	}

	@media (max-width: 1024px) {
		.section-title {
			font-size: 70px;
		}
	}

	@media (max-width: 992px) {
		.section-title {
			font-size: 60px;
		}

		.section-mini-header,
		.section-text {
			font-size: 17px;
		}
	}

	@media (max-width: 768px) {
		.section-title {
			font-size: 55px;
		}

		.section-mini-header,
		.section-text {
			font-size: 16px;
		}
	}

	@media (max-width: 650px) {
		.section-title {
			font-size: 45px;
		}

		.section-mini-header,
		.section-text {
			font-size: 15px;
		}
	}

	@media (max-width: 480px) {
		padding: 0;
		background-color: var(--clr-primary-6);

		.section-title {
			font-size: 28px;
			line-height: 3.125rem;
			background-color: var(--clr-white);
			padding: 1.25rem 5.5556vw;
		}
		
		.section-content {
			width: 100%;
			line-height: 30px;
			padding: 0 5.5556vw 8.125rem;
			margin-top: 1.875rem;
		}
	
		.section-mini-header,
		.section-text {
			font-size: 16px;
		}
	}
`

export default TermsOfUse;